# =========================================================
# Oh My Zsh (Core & Libs)
# =========================================================
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib

# =========================================================
# Плагины Oh My Zsh (Встроенные)
# =========================================================

# Подсказывает, какой пакет установить, если команда не найдена
ohmyzsh/ohmyzsh path:plugins/command-not-found
# Копирует текущую командную строку в буфер обмена по Ctrl-O
ohmyzsh/ohmyzsh path:plugins/copybuffer
# Интеграция с direnv для автоматической загрузки переменных окружения
ohmyzsh/ohmyzsh path:plugins/direnv
# Алиасы и автодополнение для Docker
ohmyzsh/ohmyzsh path:plugins/docker
# Заменяет стандартный ls на современный eza с иконками и цветами
ohmyzsh/ohmyzsh path:plugins/eza
# Распаковывает архивы любой сложности одной командой 'extract'
ohmyzsh/ohmyzsh path:plugins/extract
# Интеграция с fzf для быстрого поиска файлов и истории (Ctrl-R/T)
ohmyzsh/ohmyzsh path:plugins/fzf
# Огромный набор алиасов и функций для работы с Git
ohmyzsh/ohmyzsh path:plugins/git
# Автодополнение имен хостов из файла ~/.ssh/config
ohmyzsh/ohmyzsh path:plugins/ssh
# Позволяет добавить sudo к команде, дважды нажав Esc
ohmyzsh/ohmyzsh path:plugins/sudo
# Алиасы для управления системными сервисами через systemctl
ohmyzsh/ohmyzsh path:plugins/systemd

# =========================================================
# Сторонние плагины (External)
# =========================================================

# Умная навигация: запоминает часто посещаемые папки (команда 'z')
agkozak/zsh-z
# Заменяет стандартное меню автодополнения на интерактивное через fzf
Aloxaf/fzf-tab
# Автоматически закрывает парные скобки и кавычки при вводе
hlissner/zsh-autopair
# Автоматически загружает переменные из .env файлов при входе в каталог
hyperupcall/autoenv
# Автоматически активирует Python virtualenv при переходе в папку проекта
MichaelAquilina/zsh-autoswitch-virtualenv
# Напоминает о существовании алиаса, если вы ввели команду целиком
MichaelAquilina/zsh-you-should-use
# Создание сокращений (abbreviations), которые раскрываются при нажатии пробела
olets/zsh-abbr
# Команда 'git-open' открывает текущий репозиторий в браузере
paulirish/git-open
# Интерактивный интерфейс для git (add, log, diff) на базе fzf
wfxr/forgit

# Плагины с отложенной загрузкой (для быстрого старта терминала)
# Дополнительные правила автодополнения для множества программ
zsh-users/zsh-completions kind:defer
# Подсказывает команды серым цветом на основе вашей истории
zsh-users/zsh-autosuggestions kind:defer
# Быстрая и корректная подсветка синтаксиса в командной строке
zdharma-continuum/fast-syntax-highlighting kind:defer
# Поиск по истории команд с помощью стрелок (учитывает уже введенное)
zsh-users/zsh-history-substring-search kind:defer

# =========================================================
# Тема оформления
# =========================================================
# Минималистичная и быстрая тема
reobin/typewritten
