#!/usr/bin/zsh

# ZDOTDIR должен быть определен до всех остальных действий.
export ZDOTDIR="${ZDOTDIR:-${XDG_CONFIG_HOME:-$HOME/.config}/zsh}"

# Загружаем все конфигурационные файлы из zshrc.d
# Порядок загрузки задается номером файла с такой логикой: переменнеы окружения
# и настройки плагинов должны быть установлены до загрузки плагинов, а алиасы -
# после. 99 можно использовать для tmux/zellij, так как они должны грузиться
# последними.
# (on) - сортировка в натуральном порядке, (N) - проверка на существование
for f in ${(on)ZDOTDIR}/zshrc.d/*.zsh(N); do source $f; done
unset f
